#include<stdio.h>

int * fun(int n)
{
	int i;
	static int a[100]; // 这里用static

	for (i=0;i<n;i++) a[i]=i;

	return &a[0];
}

int main()
{
	int x[10] = {1,2,3,4,5,6,7,8,9,0};
	int *p = &x[0];
	/* 1.数组与指针 */
	//int *p = x; //x为数组名，指向数组第一个元素的地址，与上面*p=&x[0]一样
	//char p[];与char *p是等价的，习惯用后面一种。&x[2]=a+2的地址相等。
	printf("数组与指针举例：\n");
	printf("x:= %p\n",x);
	printf("&x[0]:= %p\n",&x[0]);
	printf("&p:= %p\n",&p);
	//通过数组和下标实现的表达式可以等价地通过指针及其偏移量来实现
	//数组和指针不同之处在于：指针是变量p=x和p++都是合法的，但数组不是变量，x=p与x++是非法的。
	p += 2;
	printf("*(p+2):= %d\n",*p);//输出结果为3，*(p+)指向了x[2]
	/* 2.数组指针与指针数组 */	
	int *p1[10];//声明一个指针数组，该数组有10个元素，其中每个元素都是一个指向int类型的指针,第i个元素是*p[i]。
	printf("数组指针举例：\n");
	int (*p2)[3];//声明一个数组指针p2 ，该指针指向一个数组。
	int x2[2][3] = {1,2,3,4,5,6};

	p2 = x2;
	printf("(*p2)[0]:= %d (*p2)[1]:= %d (*p2)[2]:= %d\n", (*p2)[0], (*p2)[1], (*p2)[2]);
	p2++;//对p进行算术运算，此时p将指向二维数组的下一行的首地址，即 &arr[1][0]
	printf("(*p2)[0]:= %d (*p2)[1]:= %d (*p2)[2]:= %d\n", (*p2)[0], (*p2)[1], (*p2)[2]);
	/* 3.数组返回 */
	int i, n = 5;
	int *p3; // 声明指针

	p3 = fun(n); // 返回bai指针
	for (i=0; i<n; i++) printf("数组返回:%d\n", p3[i]); // 把 p3 看成数组来输du出
	
	return 0;
}


